Tekla Open API Reference for Tekla Structures 2025
AnalysisModelHandler.GetActiveModel Method
 Gets the active model.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModel GetActiveModel()
Public Function GetActiveModel As AnalysisModel
Return Value
Type: AnalysisModel
The active model.
See Also
Reference
AnalysisModelHandler Class
Tekla.Structures.Analysis Namespace